#Задачі на перетворення типів (без умов):
#1.Користувач вводить з клавіатури два дробових числа. Вивести на екран суму цілих частин та суму дробових. Наприклад, для чисел 12.34 та 56.78 це буде 68 та 1.12.
first = float(input("Введіть перше дробове число: "))
second = float(input("Введіть друге дробове число: "))

integer_1 = int(first)
fractional_1 = first - integer_1

integer_2 = int(second)
fractional_2 = second - integer_2

print("Сума цілих частин: ", integer_1 + integer_2)
print("Сума дробових частин: ", fractional_1 + fractional_2)

#2. Користувач вводить з клавіатури суму в гривнях (дробове число). Вивести цiлу кількість гривень та окремо кількість копійок. Наприклад, ввести 45.67 — вивести 45 гривень 67 копійок.
amount = float(input("Введіть суму в гривнях: "))

integer_grivny = int(amount)
fractional_kopiyky = round((amount - integer_grivny) * 100)

print("Ціла кількість гривень: ", integer_grivny, "гривень,", "кількість копійок: ", fractional_kopiyky, "копійок")

#3.Користувач вводить з клавіатури масу в тоннах (дробове число). Вивести кількість тонн, кілограмів, грамів. (Наприклад, ввести 126.456789т — вивести 126т 456кг 789г).
mass = float(input("Введіть масу в тоннах (дробове число): "))

tons = int(mass)
kilograms = int((mass - tons) * 1000)
grams = int((mass * 1000 - tons * 1000 - kilograms) * 1000)

print("Кількість тон, кілограмів та грамів: ", tons, "т", kilograms, "кг", grams, "г" )

#4. Користувач вводить з клавіатури час у секундах. Перетворити це значення в дні, години, хвилини та секунди. Наприклад, 43512 секунд — це 0 днiв, 12 годин, 5 хвилин і 12 секунд.
amount = int(input("Введіть час у секундах: "))

days = amount // (24 * 3600) 
remaining_seconds = amount % (24 * 3600)

hours = remaining_seconds // 3600 
remaining_seconds %= 3600

minutes = remaining_seconds // 60 
seconds = remaining_seconds % 60

print("Кількість днів, годин, хвилин, секунд: ", days, "днів,", hours, "годин,", minutes, "хвилин,", seconds, "днів" )

#6. Користувач вводить з клавіатури дробове число з довгим хвостом. Округлити його до двох знаків після крапки.
number = float(input("Введіть дробове число: "))

print("Число округлене до двох знаків: ", round(number, 2))

#Задачі на if-else, if-elif-else:
#1. Ввести три числа і знайти найменше серед них.
first = float(input("Введіть перше число: "))
second = float(input("Введіть друге число: "))
third = float(input("Введіть третє число: "))

if first <= second and first <= third:
    print("Найменше число: ", first)
elif second <= first and second <= third:
    print("Найменше число: ", second)
else:
    print("Найменше число: ", third)

#2. Ввести число і з’ясувати — воно позитивне, негативне чи нуль.
number = float(input("Введіть число: "))

if number > 0:
    print("Число позитивне")
elif number < 0:
    print("Число негативне")
else:
    print("Число нуль")

#3. Вводиться ціле число (не більше 4 розрядів!). Визначити кількість цифр у ньому.
number = int(input("Введіть ціле число (не більше 4 розрядів): "))

if 0 <= number < 10:
    print("Кількість цифр: 1")
elif 10 <= number < 100:
    print("Кількість цифр: 2")
elif 100 <= number < 1000:
    print("Кількість цифр: 3")
elif 1000 <= number < 10000:
    print("Кількість цифр: 4")
else:
    print("Число має бути не більше 4 розрядів")

#Задачі на тернарний оператор:
#1. Ввести число і визначити, чи є воно парним.
number = int(input("Введіть число: "))
answer = "парне" if number % 2 == 0 else "непарне"
print("Число", answer)

#2. Ввести з клавіатури число і перевірити, чи належить це число діапазону від 0 до 100 (включно).
number = float(input("Введіть число: "))
answer = "Належить діапазону від 0 до 100." if 0 <= number <= 100 else "Не належить діапазону від 0 до 100."
print(answer)

#3. Ввести число і визначити, чи кратне воно 3, 5 та 7 одночасно.
number = int(input("Введіть число: "))
answer = "Число кратне 3, 5 та 7 одночасно" if number % 3 and number % 5 and number % 7 else "Число не кратне 3, 5 та 7 одночасно"
print(answer)

#5. Перевірити, чи має введене число дробову частину.
number = float(input("Введіть число: "))
answer = "Число має дробову частину." if number % 1 != 0 else "Число не має дробової частини."
print(answer)